src/DataProcessors/TestForFormModificator/TestForFormModificator.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>TestForFormModificator</name>
  <attributes>
    <name>РеквизитСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Флажок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПоле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШапки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПроцедурИФункций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоУспешных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьПроверки</name>
    <attributes>
      <name>РеквизитСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроверяемыеПроцедурыИФункции</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вызвано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСозданногоЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/TestForFormModificator/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаполнитьТаблицуПроверкиМетодовМетодами();

	//Проверка добавления групп
	ккПодготовкаФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(ЭтаФорма, "ОсновнаяГруппа", Неопределено);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", 1);
	ОсновнаяГруппаЛево = Элементы.ОсновнаяГруппаЛево;
	
	ПараметрыОтображения = Новый Структура("Вид, Группировка, ОтображатьЗаголовок", ВидГруппыФормы.ОбычнаяГруппа, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно, Ложь);
	ЭлементГруппаБулево = ккПодготовкаФорм.ДобавитьГруппуНаФорму(ЭтаФорма, "ГруппаБулево", ПараметрыОтображения); 
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", 1);

	//Левая колонка
	
	ккПодготовкаФорм.ДобавитьКомандуНаФорму(Этаформа, "Подключаемый_КомандаКнопки1", "Подключаемый_КомандаКнопки1", "КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 1);


	ЭлементРеквизитБулево = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(ЭтаФорма, "РеквизитБулево", ЭлементГруппаБулево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	
		
	ЭлементРеквизитСтрока = ккПодготовкаФорм.ДобавитьПолеНаФормуРеквизитОбъекта(ЭтаФорма, "РеквизитСтрока", ОсновнаяГруппаЛево, Истина, ЭлементРеквизитБулево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", , 1);	
	
	ПараметрыОтображения = Новый Структура;
	ПараметрыОтображения.Вставить("ПутьКДанным", "РеквизитДобавитьПолеНаФорму");
	РеквизитРеквизитДобавитьПолеНаФорму = ккПодготовкаФорм.ДобавитьПолеНаФорму(ЭтаФорма, "РеквизитДобавитьПолеНаФорму", ПараметрыОтображения, ОсновнаяГруппаЛево, Истина, ЭлементРеквизитСтрока);
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	

	РеквизитРеквизитДобавитьПолеНаФорму = ккПодготовкаФорм.ДобавитьПолеВШапкуФормыРеквизитОбъекта(ЭтаФорма, "РеквизитШапки", ОсновнаяГруппаЛево, ЭлементРеквизитСтрока);		
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеВШапкуФормыРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	

	//Правая колонка
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыИмяМетода", "ИмяМетода");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыВызвано", "Вызвано");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыПроверено", "Проверено");
	ЭлементТаблицаПроверряемыеМетоды = ккПодготовкаФорм.ДобавитьТаблицуНаФорму(ЭтаФорма, "ТаблицаПроверряемыеМетоды", "Объект.ПроверяемыеПроцедурыИФункции", СтруктураКолонок, Элементы.ОсновнаяГруппаПраво, , );
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	
	ЭлементТаблицаПроверряемыеМетодыУспех = ккПодготовкаФорм.ДобавитьПолеТабличнойЧастиНаформу(ЭтаФорма, "Объект.ПроверяемыеПроцедурыИФункции", "Успех", ЭлементТаблицаПроверряемыеМетоды);
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеТабличнойЧастиНаформу", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
		
	ккПодготовкаФорм.ДобавитьПолеНаФормуРеквизитФормы(ЭтаФорма, "РеквизитДобавитьПолеНаФормуРеквизитФормы", ЭлементГруппаБулево, Истина);
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитФормы", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	
	
	
	ЭлементФлажок = ккПодготовкаФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(ЭтаФорма, "Флажок", ЭлементГруппаБулево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(ЭтаФорма, "ВсегоПроцедурИФункций", ЭлементГруппаБулево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(ЭтаФорма, "ВсегоУспешных", ЭлементГруппаБулево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);
	
	ЭлементМногострочноеПоле = ккПодготовкаФорм.ДобавитьМногострочноеПолеРеквизитОбъекта(ЭтаФорма, "МногострочноеПоле", ОсновнаяГруппаЛево, РеквизитРеквизитДобавитьПолеНаФорму);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьМногострочноеПолеРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", , 1);
	
	ГруппаКнопок = ккПодготовкаФорм.ДобавитьГруппуКнопок(ЭтаФорма, ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
		
	Кнопка = ккПодготовкаФорм.ДобавитьКнопкуНаФорму(ЭтаФорма, "КнопкаКоманды1", ВидКнопкиФормы.ОбычнаяКнопка, "Подключаемый_КомандаКнопки1", , ГруппаКнопок);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКнопкуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", , 1);
	
	//
	Кнопка2 = ккПодготовкаФорм.ДобавитьКомандуИГиперссылкуНаФорму(ЭтаФорма, "КомандаКнопки2", "Подключаемый_КомандаКнопки2", "КомандаКнопки2", ОсновнаяГруппаЛево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИГиперссылкуНаФорму", 1);
		
	Кнопка3 = ккПодготовкаФорм.ДобавитьКомандуИКнопкуКоманднойПанели(ЭтаФорма, "КомандаКнопки3", "КомандаКнопки3", ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуКоманднойПанели", 1);
	
	ПараметрыОтображения = Новый Структура("Заголовок", "Подвести итог");
	Кнопка3 = ккПодготовкаФорм.ДобавитьКомандуИКнопкуНаФорму(ЭтаФорма, "КомандаКнопки4", "КомандаКнопки4", ПараметрыОтображения, ОсновнаяГруппаЛево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуНаФорму", 1);		
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки1(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки2(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки3(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки4(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
	ОбновитьИтогУспешных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновнаяГруппа

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтогУспешных()
	
	Объект.ВсегоУспешных = Объект.ПроверяемыеПроцедурыИФункции.Итог("Проверено");
	
КонецПроцедуры

Процедура ДобавитьКСчетчикуПоМетоду(ИмяМетода, Вызвано = 0, Проверено = 0)

	СтруктураПоиска = Новый Структура("ИмяМетода", ИмяМетода);
	СтрокиМетода = Объект.ПроверяемыеПроцедурыИФункции.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаМетода Из СтрокиМетода Цикл
		СтрокаМетода.Вызвано = СтрокаМетода.Вызвано + Вызвано;
		СтрокаМетода.Проверено = СтрокаМетода.Проверено + Проверено;
	КонецЦикла;

КонецПроцедуры

Процедура НаполнитьТаблицуПроверкиМетодовМетодами()
	
	МассивИменМетодов = Новый Массив;
	
	//ДобавлениеПолей
	МассивИменМетодов.Добавить("ДобавитьПолеНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитФормы");
	
	//ДобавлениеГрупп
	МассивИменМетодов.Добавить("ДобавитьГруппуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьГруппуСКолонкамиЛевоИПраво");

	//ДобавлениеТаблиц
	МассивИменМетодов.Добавить("ДобавитьТаблицуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеТабличнойЧастиНаформу");
	
	//ДобавлениеКоманд
	МассивИменМетодов.Добавить("ДобавитьКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИГиперссылкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуКоманднойПанели");	
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуНаФорму");
	
	//ДобавлениеРеквизитовОбъекта
	МассивИменМетодов.Добавить("ДобавитьРеквизитОбъектаНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеВШапкуФормыРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьМногострочноеПолеРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьГруппуКнопок");
	
	Для Каждого ИмяМетода Из МассивИменМетодов Цикл
		НоваяСтрока = Объект.ПроверяемыеПроцедурыИФункции.Добавить();
		НоваяСтрока.ИмяМетода = ИмяМетода;
	КонецЦикла;
	
	Объект.ВсегоПроцедурИФункций = Объект.ПроверяемыеПроцедурыИФункции.Количество();

КонецПроцедуры
	
#КонецОбласти
